tests/integration/cube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2700;
    }
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2800;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2900;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3000;
    }
    frontWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3100;
    }
    backWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
